blog/teachyourselfcs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>自学计算机科学</title>
<!-- 2020-12-13 Sun 17:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">自学计算机科学</h1>
<p>
site list: 
</p>
<ul class="org-ul">
<li><a href="https://teachyourselfcs.com/">https://teachyourselfcs.com/</a>
</li>
<li><a href="https://missing.csail.mit.edu/">https://missing.csail.mit.edu/</a>
</li>
<li><a href="https://dancres.github.io/Pages/">A Distributed Systems Reading List</a>
</li>
<li><a href="https://online-learning.harvard.edu/catalog/FRee">https://online-learning.harvard.edu/catalog/FRee</a>
</li>
</ul>


<p>
blog list:
</p>
<ul class="org-ul">
<li>Stripe <a href="https://stripe.com/blog">https://stripe.com/blog</a>
</li>
<li>Netflix - <a href="https://netflixtechblog.com/">https://netflixtechblog.com/</a>
</li>
<li>Cloudflare - <a href="https://blog.cloudflare.com/">https://blog.cloudflare.com/</a>
</li>
<li>Lyft — <a href="https://eng.lyft.com/">https://eng.lyft.com/</a>
</li>
<li>Uber — <a href="https://eng.uber.com/">https://eng.uber.com/</a>
</li>
<li>Instagram — <a href="https://instagram-engineering.com/">https://instagram-engineering.com/</a>
</li>
<li>Facebook — <a href="https://engineering.fb.com/">https://engineering.fb.com/</a>
</li>
<li>Google Ai — <a href="https://ai.googleblog.com/">https://ai.googleblog.com/</a>
</li>
<li>Netflix — <a href="https://medium.com/netflix-techblog">https://medium.com/netflix-techblog</a>
</li>
<li>Line Chat — <a href="https://engineering.linecorp.com/en/blog/">https://engineering.linecorp.com/en/blog/</a>
</li>
<li>Airbnb — <a href="https://medium.com/airbnb-engineering">https://medium.com/airbnb-engineering</a>
</li>
<li>Andela — <a href="https://andela.com/insights/">https://andela.com/insights/</a>
</li>
<li>Soundcloud — <a href="https://developers.soundcloud.com/blog/">https://developers.soundcloud.com/blog/</a>
</li>
<li>Discord — <a href="https://blog.discordapp.com">https://blog.discordapp.com</a>
</li>
<li>Softcom DevX — <a href="https://devx.blog/">https://devx.blog/</a>
</li>
<li>Interswitch — <a href="https://medium.com/interswitch-engineering-blog">https://medium.com/interswitch-engineering-blog</a>
</li>
<li>Carbon — <a href="https://blog.getcarbon.co/category/carbon-engineering/">https://blog.getcarbon.co/category/carbon-engineering/</a>
</li>
<li>Github — <a href="https://github.blog/category/engineering/">https://github.blog/category/engineering/</a>
</li>
<li>Gitlab — <a href="https://about.gitlab.com/blog/categories/engineering/">https://about.gitlab.com/blog/categories/engineering/</a>
</li>
<li>Heroku — <a href="https://blog.heroku.com/engineering">https://blog.heroku.com/engineering</a>
</li>
<li>BBC — <a href="https://medium.com/bbc-design-engineering">https://medium.com/bbc-design-engineering</a>
</li>
<li>Booking — <a href="https://blog.booking.com/">https://blog.booking.com/</a>
</li>
<li>Coursera — <a href="https://blog.coursera.org/">https://blog.coursera.org/</a>
</li>
<li>Dropbox — <a href="https://blogs.dropbox.com/tech/">https://blogs.dropbox.com/tech/</a>
</li>
<li>eBay — <a href="https://www.ebayinc.com/stories/blogs/tech/">https://www.ebayinc.com/stories/blogs/tech/</a>
</li>
<li>Etsy — <a href="https://codeascraft.com/">https://codeascraft.com/</a>
</li>
<li>Eventbrite — <a href="https://codeascraft.com/">https://codeascraft.com/</a>
</li>
<li>Evernote — <a href="https://evernote.com/blog/">https://evernote.com/blog/</a>
</li>
<li>LinkedIn — <a href="https://engineering.linkedin.com/blog">https://engineering.linkedin.com/blog</a>
</li>
<li>Medium — <a href="https://medium.engineering/">https://medium.engineering/</a>
</li>
<li>Mixpanel — <a href="https://mixpanel.com/blog/">https://mixpanel.com/blog/</a>
</li>
<li>Pinterest — <a href="https://medium.com/@Pinterest_Engineering">https://medium.com/@Pinterest_Engineering</a>
</li>
<li>Quora — <a href="https://engineering.quora.com/">https://engineering.quora.com/</a>
</li>
<li>Reddit — <a href="https://redditblog.com/">https://redditblog.com/</a>
</li>
<li>Riot Games — <a href="https://engineering.riotgames.com/">https://engineering.riotgames.com/</a>
</li>
<li>Salesforce — <a href="https://developer.salesforce.com/blogs/engineering/">https://developer.salesforce.com/blogs/engineering/</a>
</li>
<li>Shopify — <a href="https://engineering.shopify.com/">https://engineering.shopify.com/</a>
</li>
<li>Spotify — <a href="https://labs.spotify.com/">https://labs.spotify.com/</a>
</li>
<li>Twitter — <a href="https://blog.twitter.com/engineering/en_us.html">https://blog.twitter.com/engineering/en_us.html</a>
</li>
<li>Yelp — <a href="https://engineeringblog.yelp.com/">https://engineeringblog.yelp.com/</a>
</li>
<li>YouTube — <a href="https://youtube-eng.googleblog.com/">https://youtube-eng.googleblog.com/</a>
</li>
<li>Flosports - <a href="https://engineering.flosports.tv/">https://engineering.flosports.tv/</a>
</li>
</ul>




<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://medium.com/@jamesagwa/38-company-engineering-blogs-to-follow-as-a-software-engineer-c369e4be9afe">https://medium.com/@jamesagwa/38-company-engineering-blogs-to-follow-as-a-software-engineer-c369e4be9afe</a>
</li>
<li><a href="https://github.com/kilimchoi/engineering-blogs">https://github.com/kilimchoi/engineering-blogs</a>
</li>
</ol>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>